---
kind: method
id: M:Autodesk.Revit.DB.AnnotationSymbol.removeLeader
source: html/10347b43-8255-d40b-4507-9843af642b4f.htm
---
# Autodesk.Revit.DB.AnnotationSymbol.removeLeader Method

remove a leader of this annotation symbol.

## Syntax (C#)
```csharp
public void removeLeader()
```